app/controllers/articles_controller.rb

  def index
    @articles = Article.all  # las variables con @ son accesibles desd el controlador y la vista
---
SELECT "articles".* FROM "articles"

  def create
    @article = current_user.articles.new(article_params) # se llama al metodo article_params
      if @article.save
---
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at", "visits_count") VALUES (?, ?, ?, ?, ?, ?)  [["title", "contando articulo"], ["body", "uno nuevo"], ["user_id", 1], ["created_at", "2016-07-13 17:10:21.025640"], ["updated_at", "2016-07-13 17:10:21.025640"], ["visits_count", 0]]