app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 14], ["body", "Nuevo Comentario"], ["created_at", "2016-07-13 18:03:00.865900"], ["updated_at", "2016-07-13 18:03:00.865900"]]
---
  def create
#desde el usuario logueado accedo a has_many :coments y le paso los parametros
#que serian el id del usario logueado, el articulo que esta por url y el cuerpo
#del comentario que se envia por form
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "Nuevo Comentariooooo"], ["updated_at", "2016-07-13 18:06:38.877658"], ["id", 1]]
---
  def update
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    if @comment.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 14]]
---
    def set_article
      @article = Article.find(params[:article_id]) #obtengo el id del articulo al cual pertenece el comment